<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"613720c13092b183b344d61420f30267cb5d738ffcd16f5a86910fb559d00b8f","plan_job_ref":"Job Terraform CI-CD pipeline #27 at https://github.com/HasanAshab/go-web-app-devops/actions/runs/15723996596","plan_out_hash":"390ebf698a7d74927bdcfd467a70e274c48f9cc9c12e7012fbb9dd931ca492d1","plan_hash":"91147b1678eff0bd456059ab2c2c328243d6cb518896354b85250dedf003bef4","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.main will be created
+   resource "azurerm_kubernetes_cluster" "main" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "mainaks1"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "eastus"
+       name                                = "main-aks-1"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "go-web-app-prod"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Project" = "go-web-app"
        }
+       workload_identity_enabled           = false

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 2
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       windows_profile (known after apply)
    }

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "go-web-app-prod"
+       tags     = {
+           "Project" = "go-web-app"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   kube_config_command = "az aks get-credentials --resource-group go-web-app-prod --name main-aks-1"
```
</details>

:memo: Plan generated in [Terraform CI-CD pipeline #27](https://github.com/HasanAshab/go-web-app-devops/actions/runs/15723996596)